StandardProcessing = false;

MainWindow.ExecuteCommand ( "e1cib/list/ChartOfAccounts.General" );

fill ( "0", "Служебный", "Non-Posting" );

fill ( "111", "Незавершенные нематериальные активы", "Intangible Assets" );
fill ( "1110", "Незавершенные нематериальные активы", "Intangible Assets" );
fill ( "112", "Нематериальные активы", "Intangible Assets" );
fill ( "1121", "Авторские права и охранные документы", "Intangible Assets" );
fill ( "1122", "Патенты и товарные знаки", "Intangible Assets" );
fill ( "1123", "Ноу-хау и франшизы", "Intangible Assets" );
fill ( "1124", "Лицензии на деятельность", "Intangible Assets" );
fill ( "1125", "Программное обеспечение", "Intangible Assets" );
fill ( "1126", "Промышленные рисунки и модели", "Intangible Assets" );
fill ( "1127", "Права пользования долгосрочными активами", "Intangible Assets" );
fill ( "1128", "Нематериальные активы, полученные в хозяйственное ведение", "Intangible Assets" );
fill ( "1129", "Прочие нематериальные активы", "Intangible Assets" );
fill ( "113", "Амортизация нематериальных активов", "Intangible Assets" );
fill ( "1131", "Амортизация авторских прав и охранных документов", "Intangible Assets" );
fill ( "1132", "Амортизация патентов и товарных знаков", "Intangible Assets" );
fill ( "1133", "Амортизация ноу-хау и франшиз", "Intangible Assets" );
fill ( "1134", "Амортизация лицензий на деятельность", "Intangible Assets" );
fill ( "1135", "Амортизация программного обеспечения", "Intangible Assets" );
fill ( "1136", "Амортизация промышленных рисунков и моделей", "Intangible Assets" );
fill ( "1137", "Амортизация прав пользования долгосрочными активами", "Intangible Assets" );
fill ( "1138", "Амортизация нематериальных активов, полученных в хозяйственное ведение", "Intangible Assets" );
fill ( "1139", "Амортизация прочих нематериальных активов", "Intangible Assets" );
fill ( "114", "Обесценение нематериальных активов", "Intangible Assets" );
fill ( "1140", "Обесценение нематериальных активов", "Intangible Assets" );

class = "Fixed Assets";

fill ( "121", "Незавершенные долгосрочные материальные активы", class );
fill ( "1211", "Незавершенное строительство", class );
fill ( "1212", "Оборудование к установке", class );
fill ( "1213", "Материальные активы до ввода в эксплуатацию", class );
fill ( "1214", "Незавершенные последующие затраты", class );
fill ( "122", "Земельные участки", class );
fill ( "1221", "Земельные участки в процессе подготовки к использованию по назначению", class );
fill ( "1222", "Земельные участки без сооружений", class );
fill ( "1223", "Земельные участки с сооружениями", class );
fill ( "1224", "Земельные участки с месторождениями", class );
fill ( "1225", "Земельные участки с многолетними насаждениями", class );
fill ( "1226", "Земельные участки, полученные в хозяйственное ведение", class );
fill ( "1227", "Прочие земельные участки", class );
fill ( "123", "Основные средства", class );
fill ( "1231", "Здания", class );
fill ( "1232", "Специальные сооружения", class );
fill ( "1233", "Машины, оборудование и передаточные устройства", class );
fill ( "1234", "Транспортные средства", class );
fill ( "1235", "Инструменты и инвентарь", class );
fill ( "1236", "Последующие затраты по объектам, не принятым на баланс", class );
fill ( "1237", "Основные средства, полученные в финансовый лизинг", class );
fill ( "1238", "Основные средства, полученные в хозяйственное ведение", class );
fill ( "1239", "Прочие основные средства", class );
fill ( "124", "Амортизация основных средств", class );
fill ( "1241", "Амортизация зданий", class );
fill ( "1242", "Амортизация специальных сооружений", class );
fill ( "1243", "Амортизация машин, оборудования и передаточных устройств", class );
fill ( "1244", "Амортизация транспортных средств", class );
fill ( "1245", "Амортизация инструментов и инвентаря", class );
fill ( "1246", "Амортизация последующих затрат по объектам, не принятым на баланс", class );
fill ( "1247", "Амортизация основных средств, полученных в финансовый лизинг", class );
fill ( "1248", "Амортизация основных средств, полученных в хозяйственное ведение", class );
fill ( "1249", "Амортизация прочих основных средств", class );
fill ( "125", "Минеральные ресурсы", class );
fill ( "1250", "Минеральные ресурсы", class );
fill ( "126", "Амортизация и обесценение минеральных ресурсов", class );
fill ( "1260", "Амортизация и обесценение минеральных ресурсов", class );
fill ( "127", "Обесценение незавершенных долгосрочных материальных активов", class );
fill ( "1270", "Обесценение незавершенных долгосрочных материальных активов", class );
fill ( "128", "Обесценение земельных участков", class );
fill ( "1280", "Обесценение земельных участков", class );
fill ( "129", "Обесценение основных средств", class );
fill ( "1290", "Обесценение основных средств", class );
fill ( "131", "Незавершенные долгосрочные биологические активы", class );
fill ( "1310", "Незавершенные долгосрочные биологические активы", class );
fill ( "132", "Долгосрочные биологические активы", class );
fill ( "1320", "Долгосрочные биологические активы", class );
fill ( "133", "Амортизация и обесценение долгосрочных биологических активов", class );
fill ( "1331", "Амортизация долгосрочных биологических активов", class );
fill ( "1332", "Обесценение долгосрочных биологических активов", class );

class = "Other Long Term Assets";

fill ( "141", "Долгосрочные финансовые инвестиции в неаффилированные стороны", class  );
fill ( "1411", "Ценные бумаги", class  );
fill ( "1412", "Доли участия", class  );
fill ( "1413", "Депозиты", class  );
fill ( "1414", "Предоставленные займы", class  );
fill ( "1415", "Прочие финансовые инвестиции", class  );
fill ( "142", "Долгосрочные финансовые инвестиции в аффилированные стороны", class  );
fill ( "1421", "Ценные бумаги", class  );
fill ( "1422", "Доли участия", class  );
fill ( "1423", "Депозиты", class  );
fill ( "1424", "Предоставленные займы", class  );
fill ( "1425", "Прочие финансовые инвестиции", class  );
fill ( "151", "Инвестиционная недвижимость", class  );
fill ( "1510", "Инвестиционная недвижимость", class  );
fill ( "152", "Амортизация и обесценение инвестиционной недвижимости", class  );
fill ( "1521", "Амортизация инвестиционной недвижимости", class  );
fill ( "1522", "Обесценение инвестиционной недвижимости", class  );
fill ( "161", "Долгосрочная дебиторская задолженность", class  );
fill ( "1611", "Долгосрочная коммерческая дебиторская задолженность", class  );
fill ( "1612", "Долгосрочная дебиторская задолженность по лизингу", class  );
fill ( "1613", "Прочая долгосрочная дебиторская задолженность", class  );
fill ( "162", "Долгосрочные авансы, выданные", class  );
fill ( "1621", "Авансы, выданные в стране", class  );
fill ( "1622", "Авансы, выданные за рубежом", class  );
fill ( "171", "Долгосрочные расходы будущих периодов", class  );
fill ( "1710", "Долгосрочные расходы будущих периодов", class  );
fill ( "172", "Прочие долгосрочные активы", class  );
fill ( "1720", "Прочие долгосрочные активы", class  );

class = "Other Current Assets";

fill ( "211", "Материалы", class  );
fill ( "2111", "Сырье и основные материалы", class  );
fill ( "2112", "Вспомогательные материалы", class  );
fill ( "2113", "Запасные части", class  );
fill ( "2114", "Топливо", class  );
fill ( "2115", "Тара", class  );
fill ( "2116", "Автопокрышки и аккумуляторы, приобретенные отдельно от транспортного средства", class  );
fill ( "2117", "Материалы сельскохозяйственного назначения", class  );
fill ( "2118", "Материалы, временно переданные третьим лицам", class  );
fill ( "2119", "Прочие материалы", class  );
fill ( "212", "Оборотные биологические активы", class  );
fill ( "2120", "Оборотные биологические активы", class  );
fill ( "213", "Малоценные и быстроизнашивающиеся предметы", class  );
fill ( "2131", "Малоценные и быстроизнашивающиеся предметы в запасе", class  );
fill ( "2132", "Малоценные и быстроизнашивающиеся предметы в эксплуатации", class  );
fill ( "2133", "Временные сооружения и приспособления", class  );
fill ( "2134", "Малоценные и быстроизнашивающиеся предметы, временно переданные третьим лицам", class  );
fill ( "214", "Износ малоценных и быстроизнашивающихся предметов", class  );
fill ( "2141", "Износ малоценных и быстроизнашивающихся предметов", class  );
fill ( "2142", "Износ временных сооружений и приспособлений", class  );
fill ( "215", "Незавершенное производство", class  );
fill ( "2151", "Незавершенная продукция", class  );
fill ( "2152", "Незавершенные услуги", class  );
fill ( "2153", "Незавершенные работы", class  );
fill ( "216", "Продукция", class  );
fill ( "2161", "Готовая продукция", class  );
fill ( "2162", "Полуфабрикаты собственного производства", class  );
fill ( "2163", "Побочная продукция", class  );
fill ( "2164", "Продукция, временно переданная третьим лицам", class  );
fill ( "217", "Товары", class  );
fill ( "2171", "Ценности, приобретенные для перепродажи", class  );
fill ( "2172", "Продукция и товары, переданные для продажи в собственные магазины", class  );
fill ( "2173", "Недвижимость, предназначенная для продажи", class  );
fill ( "2174", "Товары, временно переданные третьим лицам", class  );
fill ( "21721", "Товары в розничной торговле (количественный)", class  );
fill ( "21722", "Товары в розничной торговле (общими суммами)", class  );
fill ( "225", "Дебиторская задолженность бюджета", class  );
fill ( "2251", "Дебиторская задолженность по подоходному налогу", class  );
fill ( "2252", "Дебиторская задолженность по налогу на добавленную стоимость", class  );
fill ( "2253", "Дебиторская задолженность по акцизам", class  );
fill ( "2254", "Дебиторская задолженность по другим налогам и сборам", class  );
fill ( "2255", "Прочая дебиторская задолженность бюджета", class  );
fill ( "226", "Дебиторская задолженность персонала", class  );
fill ( "2261", "Дебиторская задолженность подотчетных лиц", class  );
fill ( "22611", "Дебиторская задолженность подотчетных лиц (в леях)", class  );
fill ( "22612", "Дебиторская задолженность подотчетных лиц (в валюте)", class  );
fill ( "2262", "Дебиторская задолженность по возмещению материального ущерба", class  );
fill ( "2263", "Дебиторская задолженность по займам, выданным персоналу", class  );
fill ( "2264", "Прочая дебиторская задолженность персонала", class  );

class = "Accounts Receivable";

fill ( "221", "Коммерческая дебиторская задолженность", class  );
fill ( "2211", "Коммерческая дебиторская задолженность внутри страны", class  );
fill ( "2212", "Коммерческая дебиторская задолженность из-за рубежа", class  );
fill ( "2213", "Прочая коммерческая дебиторская задолженность", class  );
fill ( "222", "Поправки (оценочный резерв) по безнадежной дебиторской задолженности", class  );
fill ( "2220", "Поправки (оценочный резерв) по безнадежной дебиторской задолженности", class  );
fill ( "223", "Дебиторская задолженность аффилированных сторон", class  );
fill ( "2231", "Дебиторская задолженность аффилированных сторон внутри страны", class  );
fill ( "2232", "Дебиторская задолженность аффилированных сторон из-за рубежа", class  );
fill ( "2233", "Прочая дебиторская задолженность аффилированных сторон", class  );
fill ( "224", "Текущие авансы выданные", class  );
fill ( "2241", "Авансы, выданные внутри страны", class  );
fill ( "2242", "Авансы, выданные за рубежом", class  );
fill ( "231", "Дебиторская задолженность по доходам от использования третьими лицами активов субъекта", class  );
fill ( "2311", "Дебиторская задолженность по лизингу", class  );
fill ( "2312", "Дебиторская задолженность по начисленным процентам и роялти", class  );
fill ( "2313", "Дебиторская задолженность по начисленным дивидендам", class  );
fill ( "2314", "Прочая дебиторская задолженность по доходам", class  );
fill ( "232", "Предстоящая дебиторская задолженность", class  );
fill ( "2321", "Предстоящая дебиторская задолженность по расчетам с бюджетом", class  );
fill ( "2322", "Предстоящая дебиторская задолженность по лизингу", class  );
fill ( "2323", "Прочая предстоящая дебиторская задолженность", class  );
fill ( "233", "Текущая дебиторская задолженность по страхованию", class  );
fill ( "2330", "Текущая дебиторская задолженность по страхованию", class  );
fill ( "234", "Прочая текущая дебиторская задолженность", class  );
fill ( "2341", "Дебиторская задолженность по выбытию долгосрочных активов", class  );
fill ( "2342", "Дебиторская задолженность по предъявленным и признанным претензиям", class  );
fill ( "2343", "Дебиторская задолженность по другим операциям", class  );

fill ( "23112", "Дебиторская задолженность по лизингу в валюте", class  );

class = "Cash";

fill ( "241", "Касса", class  );
fill ( "2411", "Касса в национальной валюте", class  );
fill ( "2412", "Касса в иностранной валюте", class  );
fill ( "2413", "Связанные денежные средства в кассе", class  );

class = "Bank";

fill ( "242", "Текущие счета в национальной валюте", class  );
fill ( "2421", "Несвязанные денежные средства на счетах", class  );
fill ( "2422", "Связанные денежные средства на счетах", class  );
fill ( "243", "Текущие счета в иностранной валюте", class  );
fill ( "2431", "Денежные средства на счетах внутри страны", class  );
fill ( "2432", "Денежные средства на счетах за рубежом", class  );
fill ( "2433", "Связанные денежные средства на счетах", class  );
fill ( "244", "Другие банковские счета", class  );
fill ( "2441", "Аккредитивы", class  );

class = "Credit Card";
fill ( "2442", "Банковские карточки", class );
fill ( "24421", "Банковские карточки (в леях)", class  );
fill ( "24422", "Банковские карточки (в валюте)", class  );

fill ( "2443", "Денежные средства на прочих банковских счетах", class  );
fill ( "245", "Денежные переводы в пути", class  );
fill ( "2450", "Денежные переводы в пути", class  );
fill ( "246", "Денежные документы", class  );
fill ( "2460", "Денежные документы", class  );

class = "Other Current Assets";

fill ( "251", "Текущие финансовые инвестиции в неаффилированные стороны", class  );
fill ( "2511", "Ценные бумаги", class  );
fill ( "25111", "Ценные бумаги (в леях)", class  );
fill ( "25112", "Ценные бумаги (в валюте)", class  );

fill ( "2512", "Доли участия", class  );
fill ( "25121", "Доли участия (в леях)", class  );
fill ( "25122", "Доли участия (в валюте)", class  );

fill ( "2513", "Депозиты", class  );
fill ( "25131", "Депозиты (в леях)", class  );
fill ( "25132", "Депозиты (в валюте)", class  );

fill ( "2514", "Выданные займы", class  );
fill ( "25141", "Выданные займы (в леях)", class  );
fill ( "25142", "Выданные займы (в валюте)", class  );

fill ( "2515", "Прочие текущие финансовые инвестиции", class  );
fill ( "25151", "Прочие текущие финансовые инвестиции (в леях)", class  );
fill ( "25152", "Прочие текущие финансовые инвестиции (в валюте)", class  );

fill ( "252", "Текущие финансовые инвестиции в аффилированные стороны", class  );
fill ( "2521", "Ценные бумаги", class  );
fill ( "2522", "Доли участия", class  );
fill ( "2523", "Депозиты", class  );
fill ( "2524", "Выданные займы", class  );
fill ( "2525", "Прочие текущие финансовые инвестиции", class  );
fill ( "261", "Текущие расходы будущих периодов", class  );
fill ( "262", "Прочие оборотные активы", class  );
fill ( "2620", "Прочие оборотные активы", class  );
fill ( "2621", "Автопокрышки на складе", class  );
fill ( "2622", "Автопокрышки в эксплуатации", class  );
fill ( "2623", "Амортизация автопокрышек в эксплуатации", class  );
fill ( "2624", "Аккумуляторы на складе", class  );
fill ( "2625", "Аккумуляторы в эксплуатации", class  );
fill ( "2626", "Амортизация аккумуляторов в эксплуатации", class  );
fill ( "2516", "Ценные бумаги валютные", class  );
fill ( "253", "Оценочные резервы для убытков по ссудам/займам, не оплаченным в срок", class  );
fill ( "2530", "Оценочные резервы для убытков по ссудам/займам, не оплаченным в срок", class  );
fill ( "26111", "Расходы будущих периодов", class  );
fill ( "26112", "Бланки строгой отчетности", class  );

class = "Equity";

fill ( "311", "Уставный капитал", class  );
fill ( "312", "Добавочный капитал", class  );
fill ( "3121", "Эмиссионный доход", class  );
fill ( "3122", "Разницы от аннулирования или отчуждения изъятых долей участия", class  );
fill ( "3123", "Прочие элементы добавочного капитала", class  );
fill ( "313", "Неоплаченный капитал", class  );
fill ( "3131", "Неоплаченный капитал по неоплаченным собственниками долям участия", class  );
fill ( "3132", "Неоплаченный капитал по покрытию убытков предыдущих лет", class  );
fill ( "314", "Незарегистрированный капитал", class  );
fill ( "3141", "Незарегистрированные акции, выпущенные при создании общества", class  );
fill ( "3142", "Доли участия до государственной регистрации увеличения уставного капитала", class  );
fill ( "315", "Изъятый капитал", class  );
fill ( "3151", "Изъятые простые акции", class  );
fill ( "3152", "Изъятые привилегированные акции", class  );
fill ( "3153", "Изъятые вклады и паи", class  );

fill ( "321", "Резервный капитал", class  );
fill ( "3210", "Резервный капитал", class  );
fill ( "322", "Уставные резервы", class  );
fill ( "3220", "Уставные резервы", class  );
fill ( "323", "Прочие резервы", class  );
fill ( "3230", "Прочие резервы", class  );
fill ( "331", "Поправки результатов прошлых лет", class  );
fill ( "332", "Нераспределенная прибыль (непокрытый убыток) прошлых лет", class  );
fill ( "333", "Чистая прибыль (чистый убыток) отчетного периода", class  );
fill ( "334", "Использованная прибыль отчетного периода", class  );
fill ( "3340", "Использованная прибыль отчетного периода", class  );
fill ( "335", "Результат от перехода на новые нормативные акты по бухгалтерскому учету", class  );
fill ( "3350", "Результат от перехода на новые нормативные акты по бухгалтерскому учету", class  );
fill ( "341", "Фонды", class  );
fill ( "3411", "Первоначальные вклады учредителей некоммерческих организаций", class  );
fill ( "3412", "Фонд по долгосрочным активам", class  );
fill ( "3413", "Фонд самофинансирования", class  );
fill ( "3414", "Прочие фонды", class  );

fill ( "342", "Субсидии субъектов с публичной собственностью", class  );
fill ( "3421", "Субсидии по долгосрочным активам", class  );
fill ( "3422", "Прочие субсидии", class  );
fill ( "343", "Прочие элементы собственного капитала", class  );
fill ( "3430", "Прочие элементы собственного капитала", class  );
fill ( "351", "Итоговый финансовый результат", class  );
fill ( "3510", "Итоговый финансовый результат", class  );
fill ( "3111", "Уставный капитал", class  );
fill ( "3112", "Простые акции", class  );
fill ( "3113", "Привилегированные акции", class  );
fill ( "3114", "Вклады пайщиков (участников)", class  );

fill ( "3311", "Поправка прибыли предыдущих периодов", class  );
fill ( "3312", "Поправка убытков предыдущих периодов", class  );
fill ( "3321", "Нераспределенная прибыль прошлых лет", class  );
fill ( "3322", "Непокрытый убыток прошлых лет", class  );
fill ( "3331", "Чистая прибыль отчетного периода", class  );
fill ( "3332", "Чистые убытки отчетного периода", class  );
fill ( "336", "Чистый профицит (чистый дефицит) отчетного периода;", class  );
fill ( "3360", "Чистый профицит (чистый дефицит) отчетного периода;", class  );

class = "Long Term Liability";

fill ( "411", "Долгосрочные кредиты банков", class  );
fill ( "4111", "Кредиты банков в национальной валюте", class  );
fill ( "4112", "Кредиты банков в иностранной валюте", class  );
fill ( "4113", "Конвертируемые обязательства по кредитам банков", class  );
fill ( "4114", "Прочие долгосрочные кредиты банков", class  );
fill ( "4115", "Проценты по кредитам банков", class  );
fill ( "41151", "Проценты по кредитам банков (в леях)", class  );
fill ( "41152", "Проценты по кредитам банков (в валюте)", class  );

fill ( "412", "Долгосрочные займы", class  );
fill ( "4121", "Займы от неаффилированных сторон", class  );
fill ( "4122", "Займы от аффилированных сторон", class  );
fill ( "4123", "Займы путем эмиссии облигаций", class  );
fill ( "4124", "Займы от персонала субъекта", class  );
fill ( "4125", "Конвертируемые обязательства по займам", class  );
fill ( "4126", "Прочие долгосрочные займы", class  );
fill ( "4127", "Проценты по займам", class  );
fill ( "41271", "Проценты по займам (в леях)", class  );
fill ( "41272", "Проценты по займам (в валюте)", class  );

fill ( "413", "Долгосрочные обязательства по финансовому лизингу", class  );
fill ( "4130", "Долгосрочные обязательства по финансовому лизингу", class  );
fill ( "421", "Долгосрочные коммерческие обязательства", class  );
fill ( "4211", "Коммерческие обязательства внутри страны", class  );
fill ( "4212", "Коммерческие обязательства за рубежом", class  );
fill ( "4213", "Прочие коммерческие обязательства", class  );
fill ( "422", "Долгосрочные обязательства аффилированным сторонам", class  );
fill ( "4221", "Обязательства аффилированным сторонам внутри страны", class  );
fill ( "4222", "Обязательства аффилированным сторонам из-за рубежа", class  );
fill ( "4223", "Прочие обязательства аффилированным сторонам", class  );
fill ( "423", "Долгосрочные авансы полученные", class  );
fill ( "4231", "Авансы, полученные в стране", class  );
fill ( "4232", "Авансы, полученные из-за рубежа", class  );
fill ( "424", "Долгосрочные доходы будущих периодов", class  );
fill ( "4241", "Субсидии", class  );
fill ( "4242", "Прочие долгосрочные доходы будущих периодов", class  );
fill ( "425", "Долгосрочные целевые финансирование и поступления", class  );
fill ( "426", "Долгосрочные оценочные резервы", class  );
fill ( "4260", "Долгосрочные оценочные резервы", class  );
fill ( "427", "Долгосрочные обязательства по имуществу, полученному в хозяйственное ведение", class  );
fill ( "4270", "Долгосрочные обязательства по имуществу, полученному в хозяйственное ведение", class  );
fill ( "428", "Прочие долгосрочные обязательства", class  );
fill ( "4280", "Прочие долгосрочные обязательства", class  );

fill ( "41211", "Займы от неаффилированных сторон  (в леях)", class  );
fill ( "41212", "Займы от неаффилированных сторон (в валюте)", class  );

fill ( "41221", "Займы от аффилированных сторон (в леях)", class  );
fill ( "41222", "Займы от аффилированных сторон (в валюте)", class  );

fill ( "414", "Обязательства по долгосрочным сберегательным вкладам членов ссудо-сберегательных ассоциаций", class  );
fill ( "4141", "Обязательства по долгосрочным сберегательным вкладам членов ссудо-сберегательных ассоциаций", class  );
fill ( "4142", "Проценты, относящиеся к долгосрочным сберегательным вкладам членов ссудо-сберегательных ассоциаций", class  );
fill ( "4251", "Долгосрочные целевые финансирование и поступления в стране", class  );
fill ( "4252", "Долгосрочные целевые финансирование и поступления из-за рубежа", class  );

class = "Other Current Liability";

fill ( "511", "Краткосрочные кредиты банков", class  );
fill ( "5111", "Кредиты банков в национальной валюте", class  );
fill ( "5112", "Кредиты банков в иностранной валюте", class  );
fill ( "5113", "Просроченные кредиты банков в национальной валюте", class  );
fill ( "5114", "Просроченные кредиты банков в иностранной валюте", class  );
fill ( "5115", "Прочие краткосрочные кредиты банков", class  );
fill ( "5116", "Проценты по кредитам банков", class  );
fill ( "51161", "Проценты по кредитам банков (в леях)", class  );
fill ( "51162", "Проценты по кредитам банков (в валюте)", class  );

fill ( "512", "Краткосрочные займы", class  );
fill ( "5121", "Займы от неаффилированных сторон", class  );
fill ( "51211", "Займы от неаффилированных сторон (в леях)", class  );
fill ( "51212", "Займы от неаффилированных сторон (в валюте)", class  );

fill ( "5122", "Займы от аффилированных сторон", class  );
fill ( "51221", "Займы от аффилированных сторон (в леях)", class  );
fill ( "51222", "Займы от аффилированных сторон (в валюте)", class  );

fill ( "5123", "Займы путем эмиссии облигаций", class  );
fill ( "5124", "Займы от персонала субъекта", class  );
fill ( "5125", "Прочие краткосрочные займы", class  );
fill ( "5126", "Проценты по займам", class  );
fill ( "51261", "Проценты по займам (в леях)", class  );
fill ( "51262", "Проценты по займам (в валюте)", class  );

fill ( "513", "Обязательства по краткосрочным сберегательным вкладам членов ссудо-сберегательных ассоциаций", class  );
fill ( "5131", "Краткосрочные сберегательные вклады членов ссудо-сберегательных ассоциаций", class  );
fill ( "5132", "Проценты, относящиеся к краткосрочным сберегательным вкладам членов ссудо-сберегательных ассоциаций", class  );

class = "Accounts Payable";

fill ( "521", "Текущие коммерческие обязательства", class  );
fill ( "5211", "Коммерческие обязательства внутри страны", class  );
fill ( "5212", "Коммерческие обязательства из-за рубежа", class  );
fill ( "5213", "Прочие коммерческие обязательства", class  );
fill ( "522", "Текущие обязательства аффилированным сторонам", class  );
fill ( "5221", "Обязательства аффилированным сторонам внутри страны", class  );
fill ( "5222", "Обязательства аффилированным сторонам из-за рубежа", class  );
fill ( "5223", "Прочие обязательства аффилированным сторонам", class  );
fill ( "523", "Текущие авансы полученные", class  );
fill ( "5231", "Авансы полученные в стране", class  );
fill ( "5232", "Авансы полученные из-за рубежа", class  );

class = "Other Current Liability";

fill ( "531", "Обязательства персоналу по оплате труда", class  );
fill ( "5311", "Обязательства по оплате труда", class  );
fill ( "5312", "Обязательства депонентам", class  );
fill ( "532", "Обязательства персоналу по другим операциям", class  );
fill ( "5321", "Обязательства подотчетным лицам", class  );
fill ( "5322", "Обязательства персоналу по другим операциям", class  );
fill ( "533", "Обязательства по социальному и медицинскому страхованию", class  );
fill ( "5331", "Обязательства бюджету государственного социального страхования", class  );
fill ( "5332", "Обязательства фондам обязательного медицинского страхования", class  );
fill ( "5333", "Прочие обязательства по социальному и медицинскому страхованию", class  );
fill ( "534", "Обязательства бюджету", class  );
fill ( "5341", "Обязательства по подоходному налогу от предпринимательской и профессиональной деятельности", class  );
fill ( "5342", "Обязательства по подоходному налогу от оплаты труда", class  );
fill ( "5343", "Обязательства по подоходному налогу, удержанному у источника выплаты", class  );
fill ( "5344", "Обязательства по налогу на добавленную стоимость", class  );
fill ( "5345", "Обязательства по акцизам", class  );
fill ( "5346", "Обязательства по другим налогам и сборам", class  );
fill ( "5347", "Обязательства по санкциям", class  );
fill ( "5348", "Прочие обязательства бюджету", class  );
fill ( "535", "Текущие доходы будущих периодов", class  );
fill ( "5351", "Субсидии", class  );
fill ( "5352", "Прочие текущие доходы будущих периодов", class  );
fill ( "536", "Обязательства собственникам", class  );
fill ( "5361", "Обязательства по начисленным дивидендам", class  );
fill ( "5362", "Обязательства по другим операциям", class  );
fill ( "537", "Текущие целевые финансирование и поступления", class  );
fill ( "538", "Текущие оценочные резервы", class  );
fill ( "541", "Предстоящие обязательства", class  );
fill ( "5411", "Предстоящие обязательства по расчетам с бюджетом", class  );
fill ( "5412", "Предстоящие обязательства по взносам обязательного медицинского страхования", class  );
fill ( "5413", "Предстоящие обязательства по финансовому лизингу", class  );
fill ( "5414", "Прочие предстоящие обязательства", class  );
fill ( "542", "Обязательства по имущественному и личному страхованию", class  );
fill ( "5420", "Обязательства по имущественному и личному страхованию", class  );
fill ( "543", "Текущие обязательства по имуществу, полученному в хозяйственное ведение", class  );
fill ( "5430", "Текущие обязательства по имуществу, полученному в хозяйственное ведение", class  );
fill ( "544", "Прочие текущие обязательства", class  );
fill ( "5441", "Обязательства по торговым санкциям", class  );
fill ( "5442", "Прочие текущие начисленные обязательства", class  );
fill ( "5323", "Обязательства персоналу в валюте", class  );
fill ( "5371", "Обязательства по начисленным дивидендам", class  );
fill ( "5372", "Обязательства по доле в уставном капитале", class  );
fill ( "5381", "Резервы по ремонту основных средств", class  );
fill ( "5382", "Резервы по гарантиям, предоставленным клиентам", class  );
fill ( "5383", "Резервы по возврату (снижению цен) реализованных материальных ценностей", class  );
fill ( "5384", "Резервы по выплате отпусков работникам", class  );
fill ( "5385", "Резервы по рекультивации земельных участков", class  );
fill ( "5389", "Прочие резервы", class  );
fill ( "5443", "Прочие обязательства", class  );

class = "Income";

fill ( "611", "Доходы от продаж", class  );
fill ( "6111", "Доходы от реализации продукции", class  );
fill ( "6112", "Доходы от реализации товаров", class  );
fill ( "6113", "Доходы от оказания услуг", class  );
fill ( "6114", "Доходы от выполнения работ", class  );
fill ( "6115", "Доходы по договорам строительства", class  );
fill ( "6116", "Доходы по договорам операционного и финансового лизинга (аренды, имущественного найма)", class  );
fill ( "6117", "Доходы по договорам микрофинансирования", class  );
fill ( "6118", "Прочие доходы от продаж", class  );

class = "Other Income";

fill ( "612", "Другие доходы от операционной деятельности", class  );
fill ( "6121", "Доходы от выбытия других оборотных активов", class  );
fill ( "6122", "Доходы от санкций", class  );
fill ( "6123", "Доходы от возмещения материального ущерба", class  );
fill ( "6124", "Доходы от излишков долгосрочных и оборотных активов, выявленных при инвентаризации", class  );
fill ( "6125", "Доходы от списания обязательств с истекшим сроком исковой давности", class  );
fill ( "6126", "Прочие операционные расходы", class  );


class = "Income";

fill ( "621", "Доходы от операций с долгосрочными активами", class  );
fill ( "6211", "Доходы от выбытия нематериальных активов", class  );
fill ( "6212", "Доходы от выбытия долгосрочных материальных активов", class  );
fill ( "6213", "Доходы от выбытия долгосрочных финансовых инвестиций", class  );
fill ( "6214", "Доходы от выбытия инвестиционной недвижимости", class  );
fill ( "6215", "Доходы от выбытия других долгосрочных активов", class  );
fill ( "6216", "Доходы от восстановления убытков от обесценения долгосрочных активов", class  );
fill ( "6217", "Прочие доходы от операций с долгосрочными активами", class  );
fill ( "622", "Финансовые доходы", class  );
fill ( "6221", "Доходы от курсовых валютных разниц", class  );
fill ( "6222", "Доходы от суммовых разниц", class  );
fill ( "6223", "Доходы в виде роялти", class  );
fill ( "6224", "Доходы от безвозмездно поступивших долгосрочных и оборотных активов", class  );
fill ( "6225", "Доходы в виде дивидендов и участия в других субъектах", class  );
fill ( "6226", "Доходы в виде процентов от других видов деятельности", class  );
fill ( "6227", "Прочие финансовые доходы", class  );
fill ( "623", "Чрезвычайные доходы", class  );
fill ( "6231", "Доходы от компенсации убытков от стихийных бедствий", class  );
fill ( "6232", "Доходы от компенсации убытков от других чрезвычайных событий", class  );
fill ( "6233", "Прочие чрезвычайные доходы", class  );
fill ( "613", "Доходы от процентов, относящихся к выданным ссудам/займам", class  );
fill ( "6131", "Доходы от процентов, относящихся к выданным ссудам/займам", class  );
fill ( "6132", "Доходы от процентов, относящихся к краткосрочным выданным ссудам/займам", class  );
fill ( "616", "Доходы, относящиеся к целевым средствам", class  );
fill ( "6160", "Доходы, относящиеся к целевым средствам", class  );
fill ( "617", "Другие доходы (за исключением доходов от экономической деятельности)", class  );
fill ( "6170", "Другие доходы (за исключением доходов от экономической деятельности)", class  );
fill ( "618", "Доходы от экономической деятельности", class  );
fill ( "6180", "Доходы от экономической деятельности", class  );

class = "Cost of Goods Sold";

fill ( "711", "Себестоимость продаж", class  );
fill ( "7111", "Балансовая стоимость реализованной продукции", class  );
fill ( "7112", "Балансовая стоимость реализованных товаров", class  );
fill ( "7113", "Себестоимость оказанных услуг", class  );
fill ( "7114", "Себестоимость выполненных работ", class  );
fill ( "7115", "Себестоимость по договорам строительства", class  );
fill ( "7116", "Себестоимость по договорам операционного и финансового лизинга (аренды, имущественного найма)", class  );
fill ( "7117", "Себестоимость по договорам микрофинансирования", class  );
fill ( "7118", "Прочие затраты, связанные с доходами от продаж", class  );

class = "Expenses";

fill ( "712", "Расходы на реализацию", class  );
fill ( "7121", "Расходы на коммерческий персонал", class  );
fill ( "7122", "Расходы на амортизацию, содержание и ремонт долгосрочных активов коммерческого назначения", class  );
fill ( "7123", "Расходы на упаковку и другие материалы, использованные при продаже продукции и товаров", class  );
fill ( "7124", "Расходы на транспорт продукции и товаров", class  );
fill ( "7125", "Расходы на рекламу и маркетинг", class  );
fill ( "7126", "Расходы на ремонт и обслуживание продукции и товаров в гарантийный период", class  );
fill ( "7127", "Расходы по безнадежной дебиторской задолженности", class  );
fill ( "7128", "Расходы по возвратам и снижению цен", class  );
fill ( "7129", "Прочие расходы на реализацию", class  );
fill ( "713", "Административные расходы", class  );
fill ( "7131", "Расходы на административный персонал", class  );
fill ( "7132", "Расходы на амортизацию, содержание и ремонт долгосрочных активов административного назначения", class  );
fill ( "7133", "Расходы по налогам и сборам, за исключением подоходного налога", class  );
fill ( "7134", "Расходы на благотворительность и спонсирование", class  );
fill ( "7135", "Расходы по услугам административного назначения", class  );
fill ( "7136", "Представительские расходы", class  );
fill ( "7137", "Расходы на командировки административного персонала", class  );
fill ( "7138", "Прочие административные расходы", class  );
fill ( "715", "Расходы по начисленным процентам", class  );
fill ( "7151", "Расходы по начисленным процентам, относящиеся к сберегательным вкладам членов ссудо-сберегательных ассоциаций", class  );
fill ( "7152", "Расходы по начисленным процентам, относящиеся к полученным займам/кредитам", class  );
fill ( "716", "Расходы, относящиеся к целевым средствам", class  );
fill ( "717", "Другие расходы (за исключением расходов от экономической деятельности)", class  );
fill ( "7170", "Другие расходы (за исключением расходов от экономической деятельности)", class  );
fill ( "718", "Расходы от экономической деятельности", class  );
fill ( "7180", "Расходы от экономической деятельности", class  );

class = "Other Expenses";

fill ( "714", "Другие расходы операционной деятельности", class  );
fill ( "7141", "Балансовая стоимость и расходы по выбывшим другим оборотным активам", class  );
fill ( "7142", "Расходы по санкциям", class  );
fill ( "7143", "Расходы по процентам", class  );
fill ( "7144", "Расходы по недостачам и потерям от порчи долгосрочных и оборотных активов", class  );
fill ( "7145", "Расходы по списанной дебиторской задолженности, за исключением коммерческой", class  );
fill ( "7146", "Расходы от оценки запасов по чистой стоимости реализации", class  );
fill ( "7147", "Прочие операционные расходы", class  );

class = "Expenses";

fill ( "721", "Расходы, связанные с долгосрочными активами", class  );
fill ( "7211", "Балансовая стоимость и расходы по выбывшим нематериальным активам", class  );
fill ( "7212", "Балансовая стоимость и расходы по выбывшим долгосрочным материальным активам", class  );
fill ( "7213", "Балансовая стоимость и расходы по выбывшим долгосрочным финансовым инвестициям", class  );
fill ( "7214", "Балансовая стоимость и расходы по выбывшей инвестиционной недвижимости", class  );
fill ( "7215", "Балансовая стоимость и расходы по выбывшим другим долгосрочным активам", class  );
fill ( "7216", "Расходы по оценочным резервам, относящиеся к долгосрочным активам", class  );
fill ( "7217", "Убытки от обесценения долгосрочных активов", class  );
fill ( "7218", "Прочие расходы по долгосрочным активам", class  );
fill ( "722", "Финансовые расходы", class  );
fill ( "7221", "Расходы по курсовым валютным разницам", class  );
fill ( "7222", "Расходы по суммовым разницам", class  );
fill ( "7223", "Расходы по роялти", class  );
fill ( "7224", "Балансовая стоимость и расходы по безвозмездно переданным долгосрочным и оборотным активам", class  );
fill ( "7225", "Расходы по выпуску и операциям с собственными акциями", class  );
fill ( "7226", "Прочие финансовые расходы", class  );
fill ( "723", "Чрезвычайные расходы", class  );
fill ( "7231", "Расходы от стихийных бедствий", class  );
fill ( "7232", "Расходы от других чрезвычайных событий", class  );
fill ( "7233", "Прочие чрезвычайные расходы", class  );
fill ( "731", "Расходы по подоходному налогу", class  );
fill ( "7311", "Расходы по подоходному налогу", class  );
fill ( "7312", "Расходы по налогу на доход от операционной деятельности", class  );
fill ( "7313", "Прочие расходы по подоходному налогу", class  );
fill ( "811", "Основная деятельность", class  );
fill ( "812", "Вспомогательная деятельность", class  );
fill ( "821", "Косвенные производственные затраты", class  );
fill ( "8210", "Косвенные производственные затраты", class  );

fill ( "822", "Косвенные затраты по договорам на строительство", class  );
fill ( "8220", "Косвенные затраты по договорам на строительство", class  );
fill ( "823", "Общие затраты по договорам на строительство", class  );
fill ( "8230", "Общие затраты по договорам на строительство", class  );
fill ( "824", "Другие распределяемые затраты", class  );
fill ( "8240", "Другие распределяемые затраты", class  );
fill ( "831", "Торговая надбавка", class  );
fill ( "832", "Выручка от продажи ценностей за наличный расчет", class  );
fill ( "8320", "Выручка от продажи ценностей за наличный расчет", class  );
fill ( "833", "Возврат и снижение цен проданных ценностей", class  );
fill ( "8330", "Возврат и снижение цен проданных ценностей", class  );
fill ( "834", "Затраты по ценностям, переданным на переработку сторонним лицам", class  );
fill ( "8340", "Затраты по ценностям, переданным на переработку сторонним лицам", class  );
fill ( "835", "Обслуживающие производства и хозяйства", class  );
fill ( "8350", "Обслуживающие производства и хозяйства", class  );
fill ( "836", "Рефактурированные затраты", class  );
fill ( "8360", "Рефактурированные затраты", class  );
fill ( "8111", "Прямые материальные затраты", class  );

fill ( "8121", "Материальные затраты на вспомогательные виды деятельности", class  );

fill ( "8311", "Торговая надбавка в розничной торговле (количественный)", class  );
fill ( "8312", "Торговая надбавка в розничной торговле (общими суммами)", class  );

class = "Non-Posting";

fill ( "911", "Долгосрочные материальные активы, полученные в операционный лизинг (аренду, имущественный найм)", class  );
fill ( "912", "Ценности, полученные для монтажа", class  );
fill ( "913", "Долгосрочные материальные активы, переданные в финансовый лизинг", class  );
fill ( "914", "Ценности, полученные на ответственное хранение", class  );
fill ( "915", "Ценности, полученные для переработки или ремонта", class  );
fill ( "916", "Ценности, полученные по договорам комиссии", class  );
fill ( "917", "Ценности, полученные из переработанных материалов сторонних лиц", class  );
fill ( "918", "Бланки строгой отчетности", class  );
fill ( "919", "Списанная безнадежная дебиторская задолженность", class  );
fill ( "920", "Условная дебиторская задолженность", class  );
fill ( "921", "Условные обязательства", class  );
fill ( "922", "Предоставленные гарантии", class  );
fill ( "923", "Полученные гарантии", class  );
fill ( "924", "Налоговые убытки", class  );
fill ( "925", "Налоговые льготы", class  );
fill ( "AS1", "Стоимостной базис ОС I категории", class  );
fill ( "AS2", "Стоимостной базис ОС II - V категорий", class  );
fill ( "AS3", "Стоимостной базис основных средств на консервации", class  );
fill ( "AS31", "Стоимостной базис ОС I категории на консервации", class  );
fill ( "AS32", "Стоимостной базис ОС II - V категории на консервации", class  );
fill ( "AS4", "Расходы по ремонту основных средств", class  );
fill ( "AS41", "Расходы по ремонту основных средств I категории", class  );
fill ( "AS42", "Расходы по ремонту основных средств II - V категорий", class  );
fill ( "AS5", "Износ основных средств I категории", class  );
fill ( "AS", "Налоговый учет основных средств", class  );


Procedure fill ( Code, DescriptionRu, Class )

	With ( "Chart of Accounts" );
	if ( not GotoRow ( "#List", "Code", Code, false ) ) then
		GotoRow ( "#List", "Code", Code, true );
	endif;
	Click ( "#FormChange" );
	With ( "*(Chart of Accounts)" );
	try
		Check ( "#Code", Code );
		Put ( "#DescriptionRu", DescriptionRu );
		Put ( "#Class", Class );
		Click ( "#FormWriteAndClose" );
	except
		message ( Code );
	endtry;	

EndProcedure